//此正则对100个文本进行测试后，精确率为44.66%，召回率为69.77%
var sr1='^[ 　>]*第[0-9一二三四五六七八九十零〇]{1,2}([章节篇辑讲]|(部分))[  ]{0,30}\\n|^[  >]*第[0-9一二三四五六七八九十零〇]{1,2}([章节篇辑讲]|(部分))[  ]+\\S{0,30}.{0,30}\\n';
var sr2='^[ 　>]*\\d{1,2}\\.?(?!\\n|\\t)[  >]+\\S{0,20}.{0,20}\\n';
var sr3='^[ 　]*(\\d{1,2}\\.){1,3}\\d{1,2}[  ]+\\S{0,20}.{0,20}(?!\\n|\\t)\\n';
var sr4='^[ 　]*\\d{1,2}[.、](?!\\n|\\t)[  ]*\\S{0,20}.{0,20}\\n';
var sr5='^[ 　]*[一二三四五六七八九十]{1,2}[  ]+\\S{0,20}.{1,20}\\n|^[  ]*[一二三四五六七八九十]{1,2}[、.][  ]*\\S{0,20}.{1,20}\\n';
var sr6='^[ 　\\t]*[^。\n\r\f]{1,20}(?!。)[  ]*\\n(?=[ \\n]{0,50}[^\\n\\r\\f]{40,})';

var allRegExps = sr1+'|'+sr2+'|'+sr3+'|'+sr4+'|'+sr5+'|'+sr6;
var r=new RegExp(allRegExps,'gm');

module.exports = r;


